#1.2 Calculate probabilities of n-grams and find the top 10 most likely n-grams for all n.

#import the necessary libraries
from nltk import FreqDist

#import ngrams created in question 1.1
from Question1_1 import unigrams,bigrams,trigrams,four_grams

#define a function to calculate probabilities and find 10 most likely n-grams
def calculate(ngrams):
  freq_dist = FreqDist(ngrams)

  total = sum(freq_dist.values())
  probabilities = []

  for ngram, freq in freq_dist.items():
      probability = freq / total
      probabilities.append([ngram, probability])

  probabilities.sort(key=lambda x: x[1], reverse=True)

  return probabilities[:10]


#top 10 most likely unigrams
print("Top 10 Unigrams-->", calculate(unigrams))

#top 10 most likely bigrams
print("Top 10 Bigrams-->", calculate(bigrams))

#top  10 most likely trigrams
print("Top 10 Trigrams-->", calculate(trigrams))

#top 10 likely fourgrams
print("Top 10 Fourgrams-->", calculate(four_grams))


"""
sample prints
Top 10 Unigrams--> [[('ነው',), 0.01624274285978388], [('ላይ',), 0.009541454029884166], [('ውስጥ',), 0.0049857601385788685], [('ወደ',), 0.004247938630488569], [('ግን',), 0.0040916408039652075], [('ጋር',), 0.0036003149690066565], [('ነበር',), 0.0035326535722432963], [('ነገር',), 0.0030011472770529652], [('ጊዜ',), 0.002978142402153423], [('ደግሞ',), 0.0028239785119895215]]
Top 10 Bigrams--> [[('ዓ', 'ም'), 0.001648283758172326], [('ነገር', 'ግን'), 0.0007092996639102106], [(':', ':'), 0.0005790774919771796], [('ማለት', 'ነው'), 0.00048346672865144896], [('ብቻ', 'ሳይሆን'), 0.0004656665756534087], [('ምክር', 'ቤት'), 0.00034684274730684204], [('ብቻ', 'ነው'), 0.00033789062357683354], [('ኤ', 'አ'), 0.00033221747539909557], [('አዲስ', 'አበባ'), 0.00032836598030595236], [('በአዲስ', 'አበባ'), 0.00032248464320426074]]
Top 10 Trigrams--> [[('እ', 'ኤ', 'አ'), 0.00031202316601552975], [('2010', 'ዓ', 'ም'), 0.0001846635851581484], [('2011', 'ዓ', 'ም'), 0.00015811949597250698], [('ቀን', '2010', 'ዓ'), 0.00015765107086923097], [('ቀን', '2011', 'ዓ'), 0.00014057957821650473], [('2007', 'ዓ', 'ም'), 0.00010981966310137912], [('ዓ', 'ም', 'ጀምሮ'), 0.00010773777375348567], [('2008', 'ዓ', 'ም'), 0.00010617635674256559], [('2012', 'ዓ', 'ም'), 9.993068869888526e-05], [('ተወካዮች', 'ምክር', 'ቤት'), 9.597509893788771e-05]]
Top 10 Fourgrams--> [[('ቀን', '2010', 'ዓ', 'ም'), 0.00015759903183812726], [('ቀን', '2011', 'ዓ', 'ም'), 0.000140527538296877], [('ቀን', '2008', 'ዓ', 'ም'), 9.129085265656382e-05], [('ቀን', '2007', 'ዓ', 'ም'), 8.926101043672004e-05], [('ቀን', '2012', 'ዓ', 'ም'), 8.879258530906378e-05], [('ሚኒስትር', 'ዓብይ', 'አህመድ', 'ዶ/ር'), 5.647125150078206e-05], [('አመለካከት', 'ብቻ', 'የሚያንፀባርቅ', 'መሆኑን'), 4.9132591167500704e-05], [('የጸሐፊውን', 'አመለካከት', 'ብቻ', 'የሚያንፀባርቅ'), 4.803959920296944e-05], [('ጽሑፉ', 'የጸሐፊውን', 'አመለካከት', 'ብቻ'), 4.783141025734444e-05], [('የአዲስ', 'አበባ', 'ከተማ', 'አስተዳደር'), 4.0596844396875584e-05]

"""